read_verilog -formal ./full-adder.v
prep -top full_adder; flatten
sat -prove-asserts -show-inputs -show-outputs -dump_vcd ./full-adder_sat.vcd
