read_verilog -formal ./wallace_adder_18.v 
prep -top Wallace_adder_18; flatten; 
show;
sat -prove-asserts -tempinduct  
