read_verilog -formal ./mult_8.v
prep -top Mult_8; flatten; opt;
sat -prove-asserts -show-all  #-dump_vcd mult.vcd 
