read_verilog -formal ./mult.v
prep -top Mult; flatten
show;
sat -prove-asserts -show-all -dump_vcd ./mult.vcd
